// Создайте класс, описывающий строку произвольной длины. Не забывайте про принципы 
// абстракции и инкапсуляции.В классе реализуйте конструктор копирования, оператор 
// присваивания копированием и деструктор.Продемонстрируйте использование вашего класса.




//метод - функция в структуре(как работать с объектом)
//конструктор - нет возвращаемых значений, имя совпадает с классом(специальный метод который вызывается всегда, при создании объекта)
//специальный метод для удаления ~(название класса)
//Структура - хранение данных (поля открыты)
//Класс - объект для выполнение действий над ним (поля закрыты)


#include <iostream>
#include <String.h>

class String
{
	int m_a
};


int main()
{
	sn::	

}
